let i = 0;
let index1 = 1;
let index2 = 2;
let sum = 0;

console.log(`1 элемент последовательности Фибоначчи: ` + 1);
console.log(`2 элемент последовательности Фибоначчи: ` + 2);

while (i < 20) {
    i = i + 1;

    sum = index1 + index2;
    index1 = index2;
    index2 = sum;
    console.log(`${i + 2} элемент последовательности Фибоначчи: ${sum}`)
}



//----------------------------------------------------------------------------------------------------------//

// let i = 0;
// let y = 0;
// for (i = 100; i < 300; i++) {
//     if (i % 3 == 0) {
//         y++;
//         if (y % 5 == 0) {
//             console.log(i)
//         }
//     }
// }





//----------------------------------------------------------------------------------------------------------//

// function horoscope(zodiac) {
//     switch (zodiac) {
//         case 'Овен':
//             console.log('Ждет тебя вскоре поездка на море.')
//             break;

//         case 'Лев':
//             console.log(' К следующей субботе жди успех в работе.')
//             break;

//         case 'Дева':
//             console.log('Появится вдруг у тебя новый друг.')
//             break;

//         default:
//             console.log('Солнце вновь и счастье вновь - встретишь новую любовь.')
//             break;
//     }
// }

// horoscope('Овен')





//---------------------------------------------------------------------------------------------------------//


// const rodNum = function (day, month) {
//     const num = day + month;
//     alert(`Ваше родовое число: ${num}`)
// }

// let day = +prompt('Введите день рождения!');
// let month = +prompt('Введите месяц рождения!');

// rodNum(day, month);




//---------------------------------------------------------------------------------------------------------//



// const arrow = () => {
//     let sugar = true;
//     i = 0;
//     while (sugar == true) {
//         sugar = confirm('Добавить ли сахар в кофе?');
//         if (sugar == true) {
//             i++
//             alert(`Ложек сахара в кофе - ${i}`);
//         }
//         else {
//             alert('Приятного кофепития');
//         }
//     }
// }

// arrow();